#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.datarepo-alerts.data.vault_generic_secret.slack_token will be read during apply
  # (config refers to values not yet known)
 <= data "vault_generic_secret" "slack_token"  {
      + data             = (sensitive value)
      + data_json        = (sensitive value)
      + id               = (known after apply)
      + lease_duration   = (known after apply)
      + lease_id         = (known after apply)
      + lease_renewable  = (known after apply)
      + lease_start_time = (known after apply)
      + path             = "secret/suitable/terraform/stackdriver/slack-token"
    }

  # module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0] will be updated in-place
  ~ resource "google_monitoring_notification_channel" "notification_channel" {
        display_name = "staging"
        enabled      = true
        id           = "projects/terra-datarepo-staging/notificationChannels/18199841202267095917"
      ~ labels       = {
          - "auth_token"   = "xoxb-12729891575-1301495169890-SUYNuZWXKWTdFGkT4W07MfGg"
          - "channel_name" = "#jade-alerts"
        } -> (known after apply)
        name         = "projects/terra-datarepo-staging/notificationChannels/18199841202267095917"
        project      = "terra-datarepo-staging"
        type         = "slack"
        user_labels  = {}
    }

  # module.enable-services.google_project_service.required-services[14] will be created
  + resource "google_project_service" "required-services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "terra-datarepo-staging"
      + service            = "stackdriver.googleapis.com"
    }

  # module.enable-services.google_project_service.required-services[15] will be created
  + resource "google_project_service" "required-services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "terra-datarepo-staging"
      + service            = "logging.googleapis.com"
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `environments/staging`*
